## Data Integration

## Concatenation

In [2]:
import pandas as pd

In [14]:
df1 = pd.DataFrame(
    {"A" : [1,2,3], "B" : [0,9,8], "C" : [2,4,6]}
)
df2 = pd.DataFrame(
    {"acc" :[5,9,10], "loan" :[44,55,4], "age":[2,4,6]}
)

In [15]:
df1

   A  B  C
0  1  0  2
1  2  9  4
2  3  8  6

In [16]:
df2

   acc  loan  age
0    5    44    2
1    9    55    4
2   10     4    6

In [17]:
row_concat = pd.concat([df1,df2], axis = 0)

In [18]:
row_concat

     A    B    C   acc  loan  age
0  1.0  0.0  2.0   NaN   NaN  NaN
1  2.0  9.0  4.0   NaN   NaN  NaN
2  3.0  8.0  6.0   NaN   NaN  NaN
0  NaN  NaN  NaN   5.0  44.0  2.0
1  NaN  NaN  NaN   9.0  55.0  4.0
2  NaN  NaN  NaN  10.0   4.0  6.0

In [19]:
column_concat = pd.concat([df1,df2], axis = 1)

In [20]:
column_concat

   A  B  C  acc  loan  age
0  1  0  2    5    44    2
1  2  9  4    9    55    4
2  3  8  6   10     4    6

## Merging

In [22]:
df1 = pd.DataFrame(
    {"key": ["A","B","C","D"], "inv_val":[99,55,33,22], "acc":[1,3,5,7]}
)

In [29]:
df2 = pd.DataFrame(
    {"key": ["E","B","C","Z"], "hel_ration":[66,0.88,63,29], "acc":[11,32,53,74]}
)

In [31]:
df1

  key  inv_val  acc
0   A       99    1
1   B       55    3
2   C       33    5
3   D       22    7

In [32]:
df2

  key  hel_ration  acc
0   E       66.00   11
1   B        0.88   32
2   C       63.00   53
3   Z       29.00   74

In [34]:
pd.merge(df1, df2, how ="inner", on ="key", suffixes=("_df1","_df2"))

  key  inv_val  acc_df1  hel_ration  acc_df2
0   B       55        3        0.88       32
1   C       33        5       63.00       53

In [35]:
pd.merge(df1, df2, how ="outer", on ="key")

  key  inv_val  acc_x  hel_ration  acc_y
0   A     99.0    1.0         NaN    NaN
1   B     55.0    3.0        0.88   32.0
2   C     33.0    5.0       63.00   53.0
3   D     22.0    7.0         NaN    NaN
4   E      NaN    NaN       66.00   11.0
5   Z      NaN    NaN       29.00   74.0

In [36]:
pd.merge(df1, df2, how ="left", on ="key", suffixes=("_df1","_df2"))

  key  inv_val  acc_df1  hel_ration  acc_df2
0   A       99        1         NaN      NaN
1   B       55        3        0.88     32.0
2   C       33        5       63.00     53.0
3   D       22        7         NaN      NaN

In [37]:
pd.merge(df1, df2, how ="right", on ="key", suffixes=("_df1","_df2"))

  key  inv_val  acc_df1  hel_ration  acc_df2
0   E      NaN      NaN       66.00       11
1   B     55.0      3.0        0.88       32
2   C     33.0      5.0       63.00       53
3   Z      NaN      NaN       29.00       74

In [39]:
#merge with df
df1.merge(df2, how= "inner" , on = "key")

  key  inv_val  acc_x  hel_ration  acc_y
0   B       55      3        0.88     32
1   C       33      5       63.00     53

### Joining